'number' + 3 + 3 // результатом буде 'number33'. Тому що, виконується конкатенація рядка з числом, число перетворюється в рядок. Спочатку 'number' + 3 дає 'number3', а потім 'number3' + 3 дає 'number33'

null + 3 // результатом буде 3. Тому що, null перетворюється в 0, а 0 + 3 = 3

5 && "qwerty" // результатом буде "qwerty". Тому що, оператор && повертає перший false-оператор або останній true-оператор. У цьому випадку 5 є true. Тобто, тут true && true. Тому, повертається остання true "qwerty"

+'40' + +'2' + "hillel"; // результатом буде '42hillel'. Тому що, у цьому випадку унарний плюс перетворює рядки '40' і '2' в числа 40 і 2 відповідно. Потім, виконується додавання чисел 40 + 2, що дає 42. Далі, число 42 конкатенується з рядком "hillel", Виходить '42hillel'

'10' - 5 === 6; // результатом буде false. Тому що, '10' перетворюється в число 10, а 10 - 5 дає 5. Потім порівнюємо 5 === 6, що є false

true + false // результатом буде 1. Тому що, true це 1, а false це 0.    1 + 0 = 1 

'4px' - 3 // результатом буде NaN. Тому що, '4px' має нечислові символи 'px', перетворення в число ттут не можливе

'4' - 3 // результатом буде 1. Тому що, '4' можна перетворити в число. Виконується арифм. операція

'6' + 3 ** 0; // результатом буде стрінга 61. Тому що, 3 ** 0 дає число 1. Далі відбув. конкатенація стрінги '6' та числа 1. Число 1 перетворюється в рядок '1', і конкатенується з '6', даючи '61'

12 / '6' // результатом буде 2. Тому що, '6' перетворюється в число 6, а 12 / 6 = 2

'10' + (5 === 6); // результатом буде '10false'. Тому что, 5 === 6 дає false. Далі відбув. конкатенація рядка '10' та булевого значення false

null == '' // результатом буде false. Тому що, null не рівне порожньому рядку. null -> object, а '' це string. object не дорівнює string

3 ** (9 / 3); // результатом буде 27. Тому що, 9 / 3 дає 3. А 3 в степені 3 = 27

!!'false' == !!'true' /* результатом буде true. 
Тому що, будь-який непорожній рядок є true. У цьому випадку, 'false' і 'true' є непорожніми рядками. Тобто true.
Далі подвійне перевернення значень. Тому, !!'false' і !!'true' обидва дають true. Таким чином, true == true, що є true.
(Якщо по діям: 1. 'false' → truthy. 2. !truthy → false. 3. !!'false' → true. Так само і про другу частину виразу)
*/

0 || '0' && 1 /* результатом буде число 1
Тому що, оператор && має вищий пріоритет ніж ||. Спочатку виконується '0' && 1, що дає 1 -> бо, '0' — непорожній рядок → true. Тому беремо друге значення (число 1).
Потім виконується 0 || 1, що дає 1. Бо, 0 — це false, тому беремо друге значення (число 1)
*/

(+null == false) < 1; /* Тут є 3 важливі речі: унарний плюс, нестроге поріняння(перевіряє рівність значень, автоматично приводячи їх до спільного типу перед порівнянням), порівняння.
Унарний + перетворює значення в число(+null → 0).
Далі 0 == false. Оператор == робить неявне перетворення типів. false → 0 (отже, 0 == 0, дає true).
Далі, true < 1. Оператор < також робить неявне перетворення типів. true → 1 (отже, 1 < 1, дає false).
Таким чином, результатом буде false.
*/

false && true || true /* результатом буде true.
Тому що, оператор && має вищий пріоритет ніж ||. Спочатку виконується false && true, що дає false. 
Потім виконується false || true, що дає true. Бо, false — це false, тому беремо друге значення (число true)
*/

false && (false || true); /* результатом буде false
Тому що, спочатку виконуємо те що в дужках: false || true, що дає true.
Потім виконуємо false && true, що дає false. Бо, false — це false, тому беремо перше значення (число false)
*/

(+null == false) < 1 ** 5; /* результатом  буде false
Тому що, унарний + перетворює null в 0. Далі 0 == false. Оператор == робить неявне перетворення типів. false → 0 (отже, 0 == 0, дає true).
Далі, true < 1 ** 5. Оператор < також робить неявне перетворення типів. true → 1 (отже, 1 < 1 ** 5, дає false).
Таким чином, результатом буде false.
*/
