// Falsy значення в JavaScript

false
0
''
null
undefined
NaN

/*  Оператор && (AND)
Він повертає true лише тоді, коли всі умови істинні. Якщо хоча б одна умова "хибна", він каже "ні".

- повертає перше falsy значення
- якщо всі значення truthy, повертає останнє значення
*/



/*  Оператор || (OR)
Йому достатньо, щоб хоча б щось одне було істинним.
Якщо перший операнд true, JS одразу повертає результат, не перевіряючи решту.

- повертає перше truthy значення
- якщо всі значення falsy, повертає останнє значення
*/



/*  Оператор ! (NOT)
- перетворює значення в булеве і повертає протилежне
*/



/*  Унарний плюс (+)
- перетворює операнд в число
*/
