// Falsy значення в JavaScript

false
0
-0
0n // BigInt нуль
''
null
undefined
NaN

/*  Оператор && (AND)
Він повертає true лише тоді, коли всі умови істинні. Якщо хоча б одна умова "хибна", він каже "ні".

- повертає перше falsy значення
- якщо всі значення truthy, повертає останнє значення
*/



/*  Оператор || (OR)
Йому достатньо, щоб хоча б щось одне було істинним.
Якщо перший операнд true, JS одразу повертає результат, не перевіряючи решту.

- повертає перше truthy значення
- якщо всі значення falsy, повертає останнє значення
*/



/*  Оператор ! (NOT)
Важливо пам'ятати, що він завжди повертає значення типу boolean (true або false), незалежно від того, що було на вході
- перетворює значення в булеве і повертає протилежне
*/


/*  Унарний плюс (+)
Це найшвидший спосіб перетворити рядок на число в JS.
- перетворює операнд в число
*/


/* Нестроге поріняння в JavaScript
перевіряє рівність значень, автоматично приводячи їх до спільного типу перед порівнянням
*/

/* Строге порівняння в JavaScript
перевіряє рівність значень та рівність типів. Якщо типи різні, результат буде false
*/