/*
Опис ДЗ: Напишіть регулярний вираз, який знайде послідовність з шести або більше символів, які не містять літери «А» (великої або малої)

Приклад виконання:
Повинен знаходити: Wonderful, Joyful
Не повинен знаходити: Happiness, Time, Task, Apple

Умови виконання ДЗ
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки

Будь ласка, надайте наступні дані для перевірки вашої роботи:
Створіть гілку js_homework7.
Додати туди ваше домашне завдання
Вислати вашу гілку
*/

